//#define DEF_WEAPONSPEEDLIMIT	// v2.172
#define DEF_MAXCRUSADESTRUCTURES		300
#define DEF_MAXAGRICULTURE				200		//v2.19 2002-12-16


//#define NO_MSGSPEEDCHECK		// Å¬¶óÀÌ¾ðÆ® ½ºÇÇµå Ã¼Å© ÇÏÁö ¾Ê´Â ¿É¼Ç
//#define DEF_CHECKUSERNPCNUM	// À¯Àú ºñ·Ê ¸ó½ºÅÍ »ý¼º ¿É¼Ç
#define DEF_GUILDWARMODE		// ±æµåÀü ¸ðµå: Æ¯Á¤ ¸¶¹ýÀ» »ç¿ëÇÒ ¼ö ¾ø´Ù.
//#define DEF_DBGAMESERVER      // DB °ÔÀÓ¼­¹ö ¸ðµå
//#define DEF_NPCITEM			// NPC¿¡¼­ ¾ÆÀÌÅÛ ¶³¾îÁö´Â È®·üÀ» config ÆÄÀÏÀ» ÅëÇØ¼­ ÇÑ´Ù.
//#define DEF_BEGINNEREVENTMODE // ÃÊº¸ÀÚ¿ë ÀÌº¥Æ® ¸ðµå (ÃÊº¸¿ë ¹Ìµé¿¡ °æÄ¡ µÎ¹è)

//#define DEF_TESTSERVER		// Å×½ºÆ® ¼­¹ö ¸ðµå
//#define DEF_KOREA
//#define DEF_TAIWAN
//#define DEF_CHINESE
//#define DEF_JAPAN
//#define DEF_USA
#define DEF_INTERSERVER


// ¸ðµç ³ª¶ó °øÅë 
//#define	DEF_WINTER	// °Ü¿ï ¼³Á¤ (´«³»¸®°Ô ÇÑ´Ù.)
#define DEF_V219
#define DEF_BEGINNERTOWNPROTECT	// Áß¸³ ¸¶À»³»¿¡¼­ °ø°Ý ¾ÈµÊ v2.181

//#ifdef DEF_KOREA
//	#define DEF_CONSULTATION		// ½ÉÀÇ °ü·Ã
//	#define DEF_DEFENCEHACKING		// 2002-12-8 World server º¸¾È ¼³Á¤À» À§ÇØ
//	#define DEF_CHINESECANDYEVENT	// 2002-12-12 Áß±¹ »çÅÁÀÌº¥Æ®  
//#endif

#if defined(DEF_INTERSERVER)
	//#define DEF_MAXLEVEL150
	//#define DEF_DBGAMESERVER	// DB °ÔÀÓ¼­¹ö ¸ðµå 
	//#define DEF_DEFENCEHACKING  // 2002-12-8 World server º¸¾È ¼³Á¤À» À§ÇØ 
	#define DEF_ENGLISHITEMNAME		// v2.15 ÀÌ°Ç ³ªÁß¿¡ ´Ù½Ã ¼³Á¤ÇÒ ÇÊ¿ä°¡ ÀÖÀ½.. ÇöÀç ½Ã°£°ü°è»ó ¹Ì·ë
	#define DEF_LOCALNPCNAME		// v2.14 ´ë¸¸¿ë NPC ÀÌ¸§ Áß¹®È­¸¦ À§ÇØ 
#endif
//
//#ifdef DEF_TESTSERVER
//	#define DEF_DBGAMESERVER		// DB °ÔÀÓ¼­¹ö ¸ðµå
//	// Test ÁßÀÎ »çÇ×
//	// #define DEF_NPCITEM
//#endif 
//
//#ifdef DEF_USA
//	#define DEF_SAMESIDETOWNPROTECT	// °°ÀºÆí³¢¸® ¸¶À»³»¿¡¼­ °ø°Ý ¾ÈµÊ v2.172
//	#define DEF_MAXLEVEL150
////	#define DEF_ITEMDROPRATINGUP	1500
//#endif
//
//
//#ifdef DEF_TAIWAN
//	#define DEF_TAIWANLOG
////	#define DEF_DEFENCEHACKING		// 2002-12-8 World server º¸¾È ¼³Á¤À» À§ÇØ 
//	#undef	DEF_WINTER	// °Ü¿ï ¼³Á¤ (´«³»¸®°Ô ÇÑ´Ù.)
////	#define DEF_BALLEVENT           // !! ÁÖÀÇ 1¿ù1 ~ 15 ´ë¸¸ ¼Ò¿ø±¸ ÀÌº¥Æ® 
//	#define DEF_DBGAMESERVER		// DB °ÔÀÓ¼­¹ö ¸ðµå 
//	#define DEF_LOCALNPCNAME		// v2.14 ´ë¸¸¿ë NPC ÀÌ¸§ Áß¹®È­¸¦ À§ÇØ 
//	#define DEF_ENGLISHITEMNAME		// v2.15 ÀÌ°Ç ³ªÁß¿¡ ´Ù½Ã ¼³Á¤ÇÒ ÇÊ¿ä°¡ ÀÖÀ½.. ÇöÀç ½Ã°£°ü°è»ó ¹Ì·ë
//	#define DEF_LOGTIME
//#endif
//
//#ifdef DEF_CHINESE
//	#define DEF_CHINESECANDYEVENT	// 2002-12-12 Áß±¹ »çÅÁÀÌº¥Æ® 
//	#define DEF_CHINESEGUILDLIMIT
//	#define DEF_NPCITEM
//	// #define DEF_ITEMDROPRATINGUP	3000	// dice(1, 10000) > (9000 - 3000)  => ¾ÆÀÌÅÛ ¹ß»ý
//#endif
//
//#if  defined(DEF_CHINESE) ||defined(DEF_JAPAN) || defined (DEF_USA)
//	#define DEF_DBGAMESERVER		// DB °ÔÀÓ¼­¹ö ¸ðµå 
//	#define DEF_LOCALNPCNAME		// v2.14 ´ë¸¸¿ë NPC ÀÌ¸§ Áß¹®È­¸¦ À§ÇØ 
//	#define DEF_ENGLISHITEMNAME		// v2.15 ÀÌ°Ç ³ªÁß¿¡ ´Ù½Ã ¼³Á¤ÇÒ ÇÊ¿ä°¡ ÀÖÀ½.. ÇöÀç ½Ã°£°ü°è»ó ¹Ì·ë
//	#define DEF_LOGTIME
//	#define DEF_DEFENCEHACKING		// 2002-12-8 World server º¸¾È ¼³Á¤À» À§ÇØ 
//#endif



#ifdef DEF_CONSULTATION
//	#define DEF_ALLPLAYERPROTECT	// v2.19 2002-11-12 Ä³¸¯ÅÍ³¢¸® °ø°Ý ºÒ°¡´ÉÇÑ Áö¿ª ¼³Á¤ 
	#define DEF_PKPENALTY			// v2.19 2002-11-18 PK ÇÏ¸é ¹«Á¶°Ç °¨¿ÁÀ¸·Î 
	#define DEF_SAMESIDETOWNPROTECT	// °°ÀºÆí³¢¸® ¸¶À»³»¿¡¼­ °ø°Ý ¾ÈµÊ v2.172
	#define DEF_ITEMDROP			// v2.19 2002-11-14 ¾ÆÀÌÅÛ µå¶øÀ» Æ÷¼Ç°ú ¼Ò¸ð¼º ¾ÆÀÌÅÛ¸¸ µÈ´Ù.(½ÉÀÇ°ü·Ã)
#endif


/*
//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
/////////////////////////////////////        Game Sever Fix&Debug  History         ///////////////////////////////////////
//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////

//DEBUG 2003-04-20 Áß±¹ ¾ÆÀÌÅÛ º¹»ç ÄÚµå....

// TODO
// v2.22¿¡´Ù º¹»ç ÇØ¾ß ÇÑ´Ù. ´« ±×¸¸ ³»¸®°Ô ¼öÁ¤ÇÔ 
v2.20 2002-2-22 #define DEF_MAXLEVEL150
v2.20 2002-2-22 #define DEF_ITEMDROPRATINGUP
v2.20 2002-2-22 ¾ÆÀÌÅÛ È®·ü Áõ°¡ 
v2.20 2002-2-22 Àü¸éÀü ±âº» °æÇèÄ¡ Áõ°¡. 
v2.20 2002-3-3  ÁöÁ¸ ¾ÆÀÌÅÛ ¾÷±×·¹ÀÌµå¿¡ ¾ÆÀÌÅÛ ÀÌ¸§À¸·Î µé¾î°¡ ÀÖ¾î¼­ ¼öÁ¤ÇÔ  



v2.20 2002-12-28 3ÁÖ³â ±â³ä¹ÝÁö ¹ö±× ¼öÁ¤           
v2.20 2002-12-28 Àü¸éÀü Á¾·áÈÄ ¹Î°£ÀÎ ¸¶À»·Î °­ÄÝ   
v2.20 2002-12-31 ¹Î°£ÀÎ ¸ðµå ·¹º§ Á¦ÇÑ °ú ÀÌµ¿Áö¿ª Á¦ÇÑ Ãß°¡ 
v2.20 2002-12-31 ½Ã¹Î±Ç µû´Â ¼ø°£ ÀÚµ¿À¸·Î ¹Î°£ÀÎ ¸ðµå·Î ¼³Á¤µÈ´Ù.


2002-12-24 Àü¸éÀü½Ã ¼ÒÈ¯ÇÒ ¼ö ÀÖ´Â (°Ç¹° ¼ö¸¦ Á¦¿ÜÇÑ) NPCÀÇ ¼ö¸¦ Á¦ÇÑÇÑ´Ù.(´ë¸¸ ¿äÃ»)

<< v2.20 patch >>
v2.20 2002-12-28 3ÁÖ³â ±â³ä¹ÝÁö ¹ö±× ¼öÁ¤        
v2.20 2002-12-28 Àü¸éÀü Á¾·áÈÄ ¹Î°£ÀÎ ¸¶À»·Î °­ÄÝ
v2.20 2002-12-23 ¸¶¹ýÀ» ¹è¿ï¼ö ÀÖ´Â°÷ÀÎÁö Ã¼Å© ÇÑ´Ù.
v2.20 2002-12-23 Ã¢°íÀÎÁö Ã¼Å© ÇÑ´Ù.  
v2.20 2002-12-20 µµ¿ì¹Ì NPC
v2.20 2002-12-20 ¾ó¸®´Â °ø°ÝÀÌ´Ù.
v2.20 2002-12-20 ³ó»ç ½ºÅ³ ·¹º§ 20ºÎÅÍ °¡´É 
v2.20 2002-12-20 Å©¸®½º¸¶½º¿Í iceboud¸Ê¿¡¼­´Â Ç×»ó ´«ÀÌ ³»¸°´Ù.
v2.20 2002-12-20 ¸¶À» NPC °ø°Ý ¾ÊµÇ°Ô 

<< v2.19 patch >>
v2.19 2002-12-20 ´ë¸¸ ¼Ò¿ø±¸ ÀÌº¥Æ® °ü·Ã ¼³Á¤ µû·Î ÇÔ 
v2.19 2002-12-20 ½ÉÀÇ°ü·Ã ¼³Á¤ÀÌ µÇ¾îÀÖÀ¸¸é ½ºÅæ¿Àºê»õÅ©¸®ÆÄÀÌ½º°¡ ³ª¿ÀÁö ¾Ê´Â´Ù.
v2.19 2002-12-18 profileÀÌ ¾Ê³ª¿À´Â ¹ö±× ¼öÁ¤ 
v2.19 2002-12-18 ¸Ê ¸ó½ºÅÍ ¾ÆÀÌÅÛ Ãß°¡
v2.19 2002-12-16 ³ó»ç ½ºÅ³ °ü·Ã
v2.19 2002-12-14 ¸ó½ºÅÍ¿¡°Ô Á×¾úÀ»¶¼ ¾ÆÀÌÅÛÀÌ ¶³¾îÁø´Ù.. (¼ÒÈ¯¸÷ Á¦¿Ü)
v2.19 2002-12-11 »êÅ¸º¹ ¼ö¸í
v2.19 2002-12-7  ÁöÁ¸ ¾ÆÀÌÅÛ °ü·Ã
v2.19 2002-12-7  »êÅ¸º¹ °ü·Ã
v2.19 2002-12-6  Teleport ±â´É Ãß°¡
v2.19 2002-12-9  ·çµ¹ÇÁ Ãß°¡ °ü·Ã
      2002-12-11	   Áß±¹ °ü·Ã ÇØÅ· ¹æÁö ·çÆ¾ Ãß°¡

v2.19 2002-12-4 ±æµå ¸¶½ºÅÍÀÇ °æÇèÄ¡¸¦ ³ôÈù´Ù.
v2.19 2002-12-4 °Ç¼³ÇÒ¶§ ¿À¸£´Â °Ç¼³ Æ÷ÀÎÆ®´Â ³·Ãá´Ù.
v2.19 2002-12-4  ÆÄÆ¼ ¹ö±× ¼öÁ¤ 
v2.19 2002-12-3  ¸÷ÀÌº¥Æ® À§Ä¡¸¦ Å¬¶óÀÌ¾ðÆ®¿¡°Ô º¸³»ÁØ´Ù.
v2.19 2002-12-2  »çÅõÀå¿¡¼­´Â ´Ù¸¥ ±æµå´Â ÀûÀ¸·Î ÆÇ´ÜÇØ¾ß ÇÑ´Ù.
v2.19 2002-11-29 °°Àº ¼­¹öÀÇ ¸Ê ÀÌµ¿ÀÌ ÀÖÀ» °æ¿ì¿¡µµ Áßµ¶À» Á¦°ÅÇØ ÁØ´Ù. (´ë¸¸ ¿äÃ»)
v2.19 2002-11-28 [Áß±¹] °­ÄÝ½Ã°£À» ´Ù¸£°Ô ¼³Á¤ÇÑ´Ù.
v2.19 2002-11-28 [Áß±¹] ±æµå ±¸¼º Á¶°ÇÀ» ·¹º§ 100 °ú 100¸¸ °ñµå
v2.19 2002-10-25 3ÁÖ³â ÀÌº¥Æ® ¹ÝÁö È¿°ú Ãß°¡ ¹ö±× ¼öÁ¤ 
v2.19 2002-11-25 °­ÄÝ ¹ö±× ¼öÁ¤ 
v2.19 2002-11-25 ÀÏºÎ º¸Á¶ ¸¶¹ýÀº ¹Î°£ÀÎ ¸ðµå´Â º´»ç¸ðµå¿¡°Ô ºÒ°¡´ÉÇÏ´Ù.(SP´Ù¿î,ÀÎºñ,µðµ¦,¼ÒÈ¯,¹°¹æ,¸¶¹æ,¹ö¼­Å©,µ¶)
v2.19 2002-11-19 ÃÊº¸¹Ìµé °ø°Ý Àý´ë ºÒ°¡´É ÇÏ±âÀ§ÇØ º¯¼ö Ãß°¡.
v2.19 2002-11-18 PK ÇÏ¸é ¹«Á¶°Ç °¨¿ÁÀ¸·Î 
v2.19 2002-11-18 °Ç¹°¾ÈÀÎÁö Ã¼Å©ÇÏ´Â º¯¼ö Ãß°¡ 
v2.19 2002-11-17 ÆÄÆ¼¸¦ ÇÏ¸é ±âº»À¸·Î 110%°¡ ¿À¸£°í ÃÖ´ë 130% ±îÁö ¾òÀ» ¼ö ÀÖ´Ù.
v2.19 2002-11-17 °ø°Ý ½ºÅ³Àº »¡¸® ¿À¸¥´Ù.
v2.19 2002-11-17 ¸Þ¸®¿£½Ã¸®Áî´Â ÇØ¸ÓÀÇ °ø°Ý¿¡ ¹þ°ÜÁöÁö ¾Ê´Â´Ù.
v2.19 2002-11-17 ¹«±â·ù°¡ ¶³¾îÁú È®·üÀÌ ³ô¾Æ Á³´Ù.
v2.19 2002-11-17 ÆÄÆ¼ÇÏ¸é ¾ÆÀÌÅÛ ¶³¾îÁú È®·üÀÌ ³ô¾ÆÁø´Ù.
v2.19 2002-11-17 ±¤¹°,¿¬±Ý, ³¬½Ã ½ºÅ³,¹«±âÁ¦ÀÛ ¼º°ø½Ã °æÇèÄ¡¸¦ »ó½ÂÇÏ¿´´Ù.
v2.19 2002-11-17 Æ÷Á¦¼Ç ¸¶¹ýÀº ÁÖÀ§¿¡ »ç¶÷ÀÌ ÀÖÀ¸¸é È¿·ÂÀÌ ¾ø´Ù. 
v2.19 2002-11-17 ¼ÒÈ¯Àº °°Àº Æí¿¡°Ô¸¸ µÈ´Ù. 
v2.19 2002-11-15 »ç³É±ºÀÎÁö Ã¼Å©ÇÏ´Â º¯¼ö Ãß°¡ 
v2.19 2002-11-15 Àü¸éÀü½Ã Àü¿¡ Àü¸éÀü¿¡ ÁøÂÊÀº ±æµå¸¶½ºÅÍµéÀº ¼ÒÈ¯ Æ÷ÀÎÆ®¸¦ 3000À» ³Ö¾î ÁØ´Ù..
v2.19 2002-11-14 ¾ÆÀÌÅÛ °¡°Ý ¹°°¡ Á¶Á¤.
v2.19 2002-11-14 »ç³É²Û ¸ðµå Ãß°¡
v2.19 2002-11-14 ¾ÆÀÌÅÛ µå¶øÀ» ¼Ò¸ð¼º°ú ¸Ô´Â ¾ÆÀÌÅÛ¸¸ ¶³¾îÁö°Ô ¼³Á¤..
v2.19 2002-11-12 Ä³¸¯ÅÍ³¢¸® °ø°Ý ºÒ°¡´ÉÇÑ Áö¿ª ¼³Á¤ 
v2.19 2002-11-12 °­ÄÝ Áö¿ªÀ» È®´ëÇÏ±â À§ÇØ LocationName À» m_cName À¸·Î º¯°æÇÔ  Location NameÀ» °­ÄÝ Áö¿ªÀ¸·Î ¼³Á¤ÇÔ .
v2.19 2002-11-12 »óÁ¡ÀÌ³ª ´ëÀå°£¿¡¼­¸¸ ¾ÆÀÌÅÛ ¼ö¸®°¡ °¡´ÉÇÏ°Ô ¼öÁ¤ (ÇØÅ·¹æÁö¸¦ À§ÇØ)

<< v2.181 patch >>

v2.181 2002-11-6  NPC°¡ PKÇÑ ·Î±×°¡ ¾Ê³²´Â ¹ö±× ¼öÁ¤ÇÔ

v2.181 2002-11-5  °ÔÀÓ¼­¹ö Á¢¼Ó Àß¾ÈµÇ´Â ¹ö±× ¼öÁ¤ 
v2.181 2002-11-4  Quest °ü·Ã ¹ö±× ¼öÁ¤ (»èÁ¦µÈ Äù½ºÆ®¸¦ °¡Áö°í ÀÖ´Â À¯ÀúÀÇ Äù½ºÆ®¸¦ ÃÊ±âÈ­ ÇÑ´Ù.)

v2.181 2002-10-31 3ÁÖ³â ÀÌº¥Æ® ±â°£µ¿¾È ´Ù¸¥ ¼Ò¿ø±¸´Â »ý¼ºµÇÁö ¾Ê´Â´Ù.
v2.181 2002-10-31 ·¹º§ 15ÀÌ»ó¸¸  
v2.181 2002-10-31 ½Ã¹Î±Ç µû´Â ¼ø°£¿¡µµ °Ë»çÇÑ´Ù.(adamas)

v2.181 2002-10-22 #1 3ÁÖ³â ÀÌº¥Æ® : ÀÌº¥Æ®¿ë ¼Ò¿ø±¸

// 2.181 ÆÐÄ¡ /////////////////
v2.181 2002-10-24 Àû¸¶À» °Ç¹° ÀÔ±¸¿¡¼­ °­ÄÝ½Ã °Ç¹° ¾ÈÀ¸·Î µé¾î°¡´Â ¹ö±× ¼öÁ¤ 
v2.181 2002-10-24 ¼­¹ö ¼Óµµ Çâ»óÀ» À§ÇØ ½ºÆ®¸µ ºñ±³¸¦ ÁÙÀÎ´Ù.
v2.181 2002-10-24 Áß¸³ °ø°Ý ¹Þ´Â ¹ö±× ¼öÁ¤ 
v2.181 2002-10-24 ÁöÁ¸ÀÎ °æ¿ì °æÇèÄ¡ Àû°Ô ¸Ô´Â ¹ö±× ¼öÁ¤ 
v2.181 2002-10-24 Àü¸éÀü °æÇèÄ¡ »ó½Â 
v2.181 2002-10-25 3ÁÖ³â ÀÌº¥Æ® ¹ÝÁö È¿°ú Ãß°¡ 
v2.181 2002-10-25 ÃÊº¸¿ë ¹ÌµéÀÌ¸é °æÄ¡°¡ µÎ¹è 
  
v2.18 2002-10-15 Áß¿ä GM ¸í·É¾î¿¡ ÆÐ½º¿öµå Ãß°¡ 
// 2002-09-16 ÆÐÄ¡ /////////////////
v2.17 2002-09-18 #1 Á¤½Ä ÆÐÄ¡¸¦ À§ÇÑ ¸÷ À§Ä¡ º¯°æ
v2.17 2002-09-17 #1 NPCITEM ¼³Á¤ º¯°æ
v2.17 2002-09-12 #2 »õ·Î¿î ¸ó½ºÅÍ ¾ÆÀÌÅÛ ¼³Á¤
v2.17 2002-09-12 #1 (Mountain-Giant, Ettin, Carnnibal-Plant) ÃâÇö Àå¼Ò ¼³Á¤
v2.17 2002-09-11 #3 Àû ¸ó½ºÅÍ´Â ±¤ºÐµÇÁö ¾ÊÀ½
v2.17 2002-09-11 #2 ³Ãµ¿ ¹æÁö ½Ã¾à¿ë Àç·á È®·ü Áõ°¡ (¿þ¾î¿ïÇÁ½ÉÀå, ½ÎÀÌÅ¬·Ó½º°¡Á×)
v2.17 2002-09-11 #1 ¿¬±Ý ½ºÅ³ 100ÀÏ¶§ È®·ü 5% Áõ°¡
v2.17 2002-09-10 #3 Àü¸éÀü½Ã¿Í ¹Ìµé·£µå¿¡¼­¸¦ Á¦¿ÜÇÏ°í °°Àº Æí¿¡°Ô´Â ÆÐ·² ¾ÈµÊ
v2.17 2002-09-10 #2 ¾ÈÀü Áö´ë ÆÐ·² ¾ÈµÇ°Ô ÇÑ´Ù.
v2.17 2002-09-10 #1 Àû¸¶À»¿¡¼­ÀÇ °­ÄÝ ½Ã°£ 5ºÐ¿¡¼­ 3ºÐÀ¸·Î Á¶Á¤
////////////////////////////////////

v2.17 2002-09-09 #2 µð¹ö±×¿ë ¸Þ½ÃÁö ÆÄÀÏ ÀúÀå ÇÔ¼ö Ãß°¡ (adamas)
v2.17 2002-09-09 #1 NPCITEM ¼³Á¤ º¯°æ ( ±âÁ¸ÀÇ ¾Æ¾ÆÅÛ ÀÌ¸§ -> ¾ÆÀÌÅÛ ID ) (adamas)

v2.17 2002-09-06 #1 NPCITEM ¼³Á¤ (adamas)
v2.17 2002-09-05 #3 adamas 6 -> 8 ¿©±ä ¿Ö 6ÀÎÁö ¸ð¸£°Ú´Ù. MAXPARTYMEMBER define (adamas)
v2.17 2002-09-05 #2 ÀüÀï °øÇåµµ ·Î±× ³²±â±â (°°ÀºÆí NPC¸¦ Á×ÀÏ¶§) (adamas)
v2.17 2002-09-05 #1 ÃÖ°í ÁöÁ¸ ¾÷±×·¹ÀÌµå 15·Î Àç¼³Á¤ (adamas)

v2.17 2002-08-17 ¼ÒÈ¯ ¸÷À¸·Î °°Àº ¼­¹öÀÌÁö¸¸ ´Ù¸¥ ¸ã¿¡ ÀÖ´Â »ç¿ëÀÚ °ø°ÝÇÏ´Â ¹ö±× Á¦°Å (adamas)

v2.17 2002-8-6  Åõ¸í ¸ðµå¿´´Ù¸é ¸¶¹ý Casting½Ã¿¡ ÇØÁ¦µÈ´Ù. (ÀÎºñ¸¶¹ý ÇÙÀ» ¹æÁöÇÏ±â À§ÇØ)
v2.17 2002-8-6  °ø°ÝÀÚÀÇ ·¹º§ÀÌ 100 ÀÌ»óÀÌ¸é Åä³¢³ª °í¾çÀÌ¸¦ ÀâÀ»¶§ °æÇèÄ¡°¡ ¿Ã¶ó°¡Áö ¾Ê´Â´Ù.
v2.17 2002-8-5  ¿î¿µÀÚ ¸í·É¾î·Î Á×ÀÌ¸é ¾ÆÀÌÅÛÀÌ ³ª¿ÀÁö ¾Ê°Ô ¼öÁ¤ÇÑ´Ù.
v2.17 2002-8-5  ¿î¿µÀÚ´Â ÇÊµå·ù ¸¶¹ý¿¡ µ¥¹ÌÁö¸¦ ¹ÞÁö ¾Ê´Â´Ù. 
v2.17 2002-8-2  ÀÚµ¿À¸·Î ¿Ã¶ó°¡´Â °æÇèÄ¡¸¦ Áõ°¡ ½ÃÄ×´Ù.
v2.17 2002-7-31 ¾ÆÀÌÅÛÀ» ¾ÆÀÌÅÛ °íÀ¯¹øÈ£·Î »ý¼ºÇÒ ¼ö ÀÖ°Ô ÇÑ´Ù.
v2.17 2002-7-31 ÄÉ¸¯ÅÍ »ç¸Á½Ã ¶³¾îÆ®¸° ¸ðµç ¾ÆÀÌÅÛÀ» ·Î±×¿¡ ³²±â±â À§ÇØ 
v2.17 2002-7-31 »õÅ©¸®ÆÄÀÌ½º ¹ö±× ¿©ºÎ¸¦ ÆÇº°ÇÏ±â À§ÇØ ÃßÀû ·Î±× Ãß°¡ 
v2.17 2002-7-31 ÃÖ°í·¾Àº Á×¾úÀ»¶§ °æÇèÄ¡°¡ ¶³¾îÁöÁö ¾Ê´Â ºÎºÐ ¼öÁ¤ 
v2.17 2002-7-31 Á¦ÀÛ ¾ÆÀÌÅÛµµ ·Î±×¿¡ ³²°Ô ÇÑ´Ù.
v2.17 2002-7-22 /fi ¹ö±× ¼öÁ¤ (°¡²û ´©°¡ Á¢¼ÓÁßÀÔ´Ï´Ù. ³ª¿À´Â ¹ö±×)
v2.17 2002-7-21 ¸¶À»°ú ³ó°æÁö¿¡¼­¸¸ °°Àº Æí¿¡°Ô °ø°Ý ¹ÞÁö ¾Ê°Ô ¼³Á¤ÇÔ 
v2.17 2002-7-21 Àü¸éÀü½Ã ÃÊº¸Á¸°ú ³ó°æÁö¿¡¼­´Â °æÇèÄ¡¸¦ ±×´ë·Î ¾òÀ» ¼ö ÀÖ´Ù.
v2.17 2002-7-21 ¾ÆÀÌÅÛ ¾÷±×·¹ÀÌµå ½ÇÆÐ ¿øÀÎÀ» »ç¿ëÀÚ¿¡°Ô º¸¿©ÁØ´Ù.  
v2.17 2002-7-15 ¼ºÈÄ´Ï ¼öÁ¤ °­ÄÝ ½Ã°£À» Á¶Àý ÇÒ ¼ö ÀÖ°Ô ¼öÁ¤ÇÑ´Ù.
v2.17 2002-7-4  ¼ºÈÄ´Ï ¼öÁ¤ ¿î¿µÀÚ°¡ Á¢¼ÓÇÏ¸é ÀÚµ¿À¸·Î Åõ¸í»óÅÂ°¡ µÇµµ·Ï ¼öÁ¤ÇÔ 
v2.17 2002-7-4  ¼ºÈÄ´Ï ¼öÁ¤ »çÅõÀåÀÇ °¹¼ö¸¦ 10°³ ÀÌ»ó ´Ã¸± ¼ö ÀÖµµ·Ï »çÅõÀå È®ÀÎ ·çÆ¾ º¯°æ 
v2.17 2002-7-4  ¼ºÈÄ´Ï ¼öÁ¤ ¸÷ÀÌº¥Æ®½Ã ¸÷ÀÇ °¹¼ö¸¦ ¸Ê¿¡¼­ ¼³Á¤ ÇÒ ¼ö ÀÖ°Ô ÇÑ´Ù.
v2.17 2002-7-4  ¼ºÈÄ´Ï ¼öÁ¤ ºñ¿Ã È®·üÀ» ³·Ãá´Ù.
v2.172 2002-7-4 °í±¤Çö ¼öÁ¤ ÇØ¸Ó ¼Óµµ Á¦ÇÑ, ¸Â¾ÒÀ»¶§ ¹þ°ÜÁö´Â È¿°ú, 
v2.17           ±æµåÀü ¸ðµå¿¡¼­´Â »çÅõÀå¿¡¼­ °­ÄÝµÇÁö ¾Ê´Â´Ù.
v2.17 2002-6-29 ±¤¹° Ä¶¶§ È¤Àº Á×À»Ã´ ÇÒ¶§ Åõ¸í ¸ðµå¿´´Ù¸é ¸¶¹ý Casting½Ã¿¡ ÇØÁ¦µÈ´Ù.
v2.17 2002-7-2  ¼ºÈÄ´Ï º¯°æ ÁÖ¸Ô¹ö±× ¼öÁ¤À» À§ÇØ 
v2.16 2002-6-2  ¼ºÈÄ´Ï ¼öÁ¤ ¼ö¸íÀÌ À½¼öÀÏ °æ¿ì¿¡ °üÇÑ ·çÆ¾ Ãß°¡ 
v2.16 2002-6-2  ¼ºÈÄ´Ï ¼öÁ¤ Àû¸¶À»¿¡¼­ ¸®ÄÝ¹× ºí¸®µùµî ÀÔÀå±Ç ¾ÊµÇ°Ô ¼öÁ¤ÇÔ 
v2.16 2002-5-31 ¼ºÈÄ´Ï ¼öÁ¤ Àû¸¶À»¿¡¼­ Á×À¸¸é °¨¿Á¿¡ °¡°Ô ¼öÁ¤ÇÔ 
v2.16 2002-5-27 ¼Ó¿Ê º¯È¯ ½Ã¾à Ãß°¡ 
v2.16 2002-5-27 ¼ºÈÄ´Ï ¼öÁ¤ ÇØ¸Ó ¹× ÁöÆÎÀÌ ÇÊ»ì±â ¹× ½ºÅ³ Ãß°¡
v2.15 2002-5-21 ¼ºÈÄ´Ï ¼öÁ¤ GM Shutup ¸í·É¾î Àü ¼­¹ö¿¡ º¸³»±â 
v2.15 2002-5-15 ¼ºÈÄ´Ï ¼öÁ¤ ÀÓ½Ã·Î ´ë¸ó¿¡¼­ ¾ÆÀÌÅÛ ¾Ê³ª¿À°Ô ¼öÁ¤ÇÔ 
v2.15 2002-5-15 ¼ºÈÄ´Ï ¼öÁ¤ Robe ¼ö¸® °¡´ÉÇÏ°Ô ¼öÁ¤ÇÔ 
v2.15 2002-5-15 °í±¤Çö ¼öÁ¤ GM¿ë ¾ÆÀÌÅÛ ¹× È¿°ú Ãß°¡ 
v2.15 2002-5-6  °ÔÀÓ ¼­¹ö °ü¸® Å¬¶óÀÌ¾ðÆ® Á¢¼Ó Ãß°¡ 
v2.15 2002-5-6  °ÔÀÓ ¼­¹ö Á×À»¶§ ¿¡·¯ ¸Þ¼¼Áö ³ª¿À´Â°Å ¼öÁ¤ 
v2.15 2002-5-6  ÁöÁ¸ ¾ÆÀÌÅÛ ¹ö±× ¼öÁ¤  
v2.15 2002-4-20 ¼ºÈÄ´Ï º¯°æ ¾ÆÀÌÅÛÀÌ ³ª¿Ã È®·ü ¾à°£ Áõ°¡ ½ÃÅ´ 
v2.15 2002-4-20 ¼ºÈÄ´Ï º¯°æ ¸¶¹ý ¼º°ø·ü Àß¸ø³ª¿À´Â°Å ¼öÁ¤ÇÔ
v2.15 2002-4-19 ¼ºÈÄ´Ï º¯°æ Àü¸éÀü½Ã °Ç¹°ÀÇ HP¸¦ º¸¿©ÁÖ±â À§ÇÑ ·çÆ¾ Ãß°¡ ÁÖÀÇ !!! °Ç¹° 4°³ÀÏ °æ¿¡ ¸ÂÃç ·çÆ¾ Çü¼º 
v2.15 2002-2-29 ¼ºÈÄ´Ï º¯°æ È°¹ö±× ¼öÁ¤À» À§ÇÑ ·çÆ¾ Ãß°¡ 
v2.15 2002-2-29 ¼ºÈÄ´Ï º¯°æ °­Á¦ Á¢¼Ó Á¾·á ¼öÄ¡°¡ 3000ÀÌ»ó ¿À¸£´Â °æ¿ì 10 À¸·Î ¼¼ÆÃ
v2.15 2002-2-29 ¼ºÈÄ´Ï º¯°æ ÀûÁ×ÀÏ°æ¿ì ±âº» °æÇèÄ¡ »ó½Â 
v2.15 2002-2-29 ¼ºÈÄ´Ï º¯°æ Àü¸éÀü½Ã Àü»ç´Â 80 ÀÌÇÏ´Â 2¹è 80~100 Àº 1.7¹è·Î  »ó½Â  ¹ý»ç´Â 80ÀÌÇÏ´Â 1.7¹è 80~100Àº 1.5¹è·Î ¼öÁ¤ 
v2.15 2002-2-29 ¼ºÈÄ´Ï º¯°æ Àü¸éÀü ±âº» °æÇèÄ¡ »ó½Â Àû¿ï Á×ÀÎ°æ¿ì °æÇèÄ¡¸¦ Á¶Àý ÇÏ¿´´Ù.
v2.15 2002-2-28 ¼ºÈÄ´Ï º¯°æ ³ó°æÁö¿¡¼­´Â ·¹º§ 80ÀÌ»óÀÌ¸é °æÇèÄ¡ 2/3¸¸ ¾òµµ·Ï ¼öÁ¤ÇÔ 
v2.15 2002-2-26 ¼ºÈÄ´Ï º¯°æ ³ó°æÁö¿¡¼­´Â ·¹º§ 100ÀÌ»óÀÌ¸é °æÇèÄ¡ ¹ÝÀý¸¸ ¾òµµ·Ï ¼öÁ¤ÇÔ 
v2.15 2002-2-26 ¼ºÈÄ´Ï º¯°æ ÁöÁ¸¾ÆÀÌÅÛ ¾÷±Û °ü·Ã ·çÆ¾ ¼öÁ¤ÇÔ 
v2.14 2002-2-18 ¼ºÈÄ´Ï º¯°æ ¿î¿µÀÚ °ü·Ã ·Î±× Ãß°¡ ¼ÒÈ¯,Áßµ¶,½ºÅ³,¾ÆÀÌÅÛ¼ö¸®, Give°ü·Ã ·Î±× µ·µµ ·Î±× ³²°Ô ¼öÁ¤ 
v2.14 2002-2-18 ¼ºÈÄ´Ï º¯°æ ¿î¿µÀÚ¿¡°Ô ¿À´Â ±Ó¸»µµ ¿î¿µÀÚ ·Î±×·Î ³²°Ô ¼öÁ¤ÇÔ 
v2.14 2002-2-18 ¼ºÈÄ´Ï º¯°æ ½ºÅ³ ·Î±×¸¦ À§ÇØ Skill.cfgµµ Áß¹®È­ ÇÔ 
v2.14 2002-2-17 ¼ºÈÄ´Ï º¯°æ ¿î¿µÀÚ ÅÚ·¹Æ÷Æ®°¡ Àß¸øµÇ¸é º¹±¸ÇÏ´Â ·çÆ¾ Ãß°¡ 
v2.14 2002-2-16 ¼ºÈÄ´Ï º¯°æ Ã¢°í¿¡ ¾ÆÀÌÅÛ ¸Â±â¸é ¼øµµ°¡ ÀÌ»óÇØÁö´Â ¹®Á¦ ÇØ°á (Å¬¶óÀÌ¾ðÆ® ¼öÁ¤¿ä)
v2.14 2002-2-15 ¼ºÈÄ´Ï º¯°æ ¿ùµå ¼­¹ö ÀúÀå½Ã ¼º´É Çâ»ó (CharID ¸¦ º¸³»°í ¹ÞÀ½) DEF_DBGAMESERVER
v2.14 2002-2-15 ¼ºÈÄ´Ï º¯°æ ³ó°æÁö¿¡¼­ µ¥¸ó »ý¼º È®·ü ³·Ãã 
v2.14 2002-2-15 ¼ºÈÄ´Ï º¯°æ °°Àº °íÀ¯ ¹øÈ£°¡ ³ª¿À´Â È®À²À» ÁÙÀÓ DEF_LOGTIME 
v2.14 2002-2-15 ¼ºÈÄ´Ï º¯°æ GM ¸í·É¾î¸¦ »ç¿ëÇÒ ¼ö ÀÖ´Â GM LevelÀ» ´ë¸¸¿¡ ¿ä±¸ ´ë·Î ¼öÁ¤ÇÔ 
v2.14 2002-2-15 ¼ºÈÄ´Ï º¯°æ GM Àº ¸ÞÅ×¿À¸¦ ¸Â¾Æµµ µ¥¹ÌÁö¸¦ ÀÔÁö ¾Ê°Ô ¼öÁ¤ÇÔ 
v2.14 2002-2-15 ¼ºÈÄ´Ï º¯°æ °ÔÀÓ¼­¹ö ¶óÀÌºê·¯¸®·Î ¸¸µé¾î¼­ ÄÄÆÄÀÏ ÇÏ¸é µð¹ö±ë ¾ÊµÇ´Â ¹®Á¦ ÇØ°á !! MSDN ÂüÁ¶ /C7 ·Î ÄÄÆÄÀÏ ÇÒ°Í 
v2.14 2002-2-14 ¼ºÈÄ´Ï º¯°æ ºÎÈ°Á¸ ÅÚ·¹Æ÷Æ® °¡´ÉÇÏ°Ô ¼öÁ¤ 
v2.14 2002-2-14 ¼ºÈÄ´Ï º¯°æ Áß¸³ ¸®ÄÝ¾ÊµÇ´Â ¹ö±× ¼öÁ¤ 
v2.14 2002-2-13 ¼ºÈÄ´Ï º¯°æ ·Î±× °ü·Ã ¹ö±× ¹ß°ß ¼öÁ¤ pItem = 0 Ãß°¡ 
v2.14 2002-2-13 ¼ºÈÄ´Ï º¯°æ °íÀ¯¹øÈ£ °­È­ (¿ùÀÏ½Ã) ½ÃÃß°¡ 
v2.14 2002-2-13 ¼ºÈÄ´Ï º¯°æ °ÔÀÓ¼­¹ö ´Ù½Ã ´Ù¿î ÀÇ½É °¡´Â ·çÆ¾(def_itemlog_buy)¿¡ ¿¹¿Ü Ã³¸® Ãß°¡ 
v2.14 2002-2-12 ¼ºÈÄ´Ï º¯°æ GM ÀÎ°æ¿ì Ã¼ÆÃ ¸Þ¼¼Áö ±îÁö ·Î±× ³²±è 
v2.14 2002-2-12 ¼ºÈÄ´Ï º¯°æ /fi ±â´É Ãß°¡ ÁÂÇ¥ ±îÁö (Å¬¶óÀÌ¾ðÆ® ¼öÁ¤ÇÔ)
v2.14 2002-2-12 ¼ºÈÄ´Ï º¯°æ Ä«¸®½º¸¶°¡ 10ÀÎ °æ¿ì ¾ÆÀÌÅÛ ÇÒÀÎ ¾ø°Ô ¼öÁ¤ÇÔ
v2.14 2002-2-12 ¼ºÈÄ´Ï º¯°æ »óÁ¡ ¾ÆÀÌÅÛµµ °íÀ¯¹øÈ£ Ãß°¡ 
v2.14 2002-2-12 ¼ºÈÄ´Ï º¯°æ GM¾ÆÀÌÅÛ ·Î±× ±úÁö´Â °æ¿ì ¹ß°ß ¼öÁ¤ÇÔ 
v2.14 2002-2-11 ¼ºÈÄ´Ï º¯°æ NPC ÀÌ¸§ Áß¹®È­¸¦ À§ÇÑ ¼±¾ð DEF_LOCALNPCNAME(Å¬¶óÀÌ ¾ðÆ® ¼öÁ¤ÇÔ)
v2.14 2002-2-11 ¼ºÈÄ´Ï º¯°æ ¾ÆÀÌÅÛ ·Î±× °­È­ Á¤ÇüÈ­ ½ÃÅ´ »õ·Î¿î Çü½ÄÀÇ _bItemLog Ãß°¡ ¹× »óÁ¡¿¡¼­ °°Àº ¾ÆÀÌÅÛÀ» ¿©·¯°³ »ê°æ¿ì ·Î±× ÇÏ³ª·Î ¼öÁ¤
v2.14 2002-2-11 ¼ºÈÄ´Ï º¯°æ Áß¹®È­ °ü·Ã ¹ö±× ¼öÁ¤ ±æµå °ü·Ã (DEF_ENGLISHITEMNAME)
v2.14 2002-2-11 ¼ºÈÄ´Ï º¯°æ GM Log ¿ùµå ¼­¹ö·Î º¸³»¾î ÆÄÀÏ ÇÏ³ª·Î ÅëÀÏÇÔ (¿ùµå ¼­¹ö ¼öÁ¤ÇÔ)
v2.14 2002-2-10 ¼ºÈÄ´Ï º¯°æ ¾ÆÀÌÅÛ ·Î±× °­È­ ¸ÊÀÇ ÁÂÇ¥ ¹× ¾ÆÀÌÅÛ Èê¸° Npc ÀÌ¸§µî 
v2.14 2002-2- 9 ¼ºÈÄ´Ï º¯°æ /disconnect ¸í·É½Ã ¼­¹ö ´Ù¿î ¼öÁ¤ 
*/





